{"total_patches": 7, "formatted_patches": [{"id": "20250214", "title": "Marvel Rivals Version 20250214 Patch Notes", "date": "2025/02/13", "overview": "The second half of Season 1 is coming soon! Expect new heroes, a new map, and balance adjustments. Stay tuned for the latest updates from the official announcements!", "fullContent": "Greetings, Rivals!\n\nWe're thrilled to announce that the upcoming patch drops on February 13, 2025, at 09:00:00 (UTC+0)! This update will also be applied without server downtime—so you can dive right back into your epic battles as soon as the update is live!\n\n \n\nHere's a look at what's coming in this patch:\n\n\nALL-NEW COSTUMES\n\nMister Fantastic & Invisible Woman - 60th Wedding Anniversary Combo Bundle (Store release: 2025/02/14 02:00:00 UTC+0)\n\nMister Fantastic - The Life Fantastic (Store release: 2025/02/14 02:00:00 UTC+0)\n\nInvisible Woman - The Life Fantastic (Store release: 2025/02/14 02:00:00 UTC+0)\n\n \n\n\nBUG FIXES\n\n\nALL PLATFORMS\n\nGeneral\n\n1. High-end computers running the Bazzite (Linux) system were mistakenly tapping into low-quality UI resources. Fear not—this issue has been rm'd!\n\n \n\nMaps and Gameplay\n\n1. Resolved an issue where if you scored KOs during overtime and the battle concluded at that moment, the KDA tab might not have shown its true colors. Now every victory is honored!\n\n2. Corrected an issue where the Yggdrasill Path cart icon in the Convoy tutorial was a bit off-target. Your heroic journey can now continue with clarity!\n\n3. A heroic sweep has been performed to fix various map collisions that could trap players or allow them to slip through walls unexpectedly. Your path to glory is now cleared!\n\n \n\nHero Bug Fixes\n\n1. Doctor Strange's Portal Power: Fixed an issue where Doctor Strange's portal could be interrupted during the placement phase if an allied Loki transformed into him. The Sorcerer Supreme's magic now flows uninterrupted!\n\n2. Jeff the Land Shark's Bubble Trouble: Resolved a quirky situation where Jeff's bubbles could, in rare instances, sneak past enemy healing gates into the spawn room. No more bubble bath break-ins!\n\n3. Iron Man's \"Armless\" Attack: Addressed a tech malfunction where Iron Man's arm models could go missing after activating Armor Overdrive in certain rare scenarios. The suit's back in action—fully equipped to blast into battle!\n\n4. Hulk & Wolverine's Team-Up Trouble: Fixed a little mischief where because of their Team-Up Ability, Wolverine's Berserk Claw Strike could, under certain situations, be activated during Feral Leap. Now, there will be no more mix-ups!\n\n5. Hulk's Charge Hiccup: Resolved a Team-Up Ability bug where if Hulk was hit by Namor's ultimate when charging to throw Wolverine, he wouldn't be thrown afterward. Now, the power duo can deliver a one-two punch without any interruptions—Hulk smash, Wolverine slash!\n\n \n\n\nCONSOLE\n\n1. Fixed an issue where the PS controller could experience drift in certain specific situations.\n\n \n\nThe second half of Season 1 is coming soon! Expect new heroes, a new map, and balance adjustments. Stay tuned for the latest updates from the official announcements!\n\n \n\nFor more information about us, check out and follow our other social channels.\n\nDiscord [https://discord.gg/marvelrivals]|X [https://twitter.com/MarvelRivals]|Facebook [https://www.facebook.com/marvelrivals]|Instagram [https://www.instagram.com/marvelrivals/]|TikTok [https://www.tiktok.com/@marvelrivals]|YouTube [https://www.youtube.com/@MarvelRivals]|Twitch [https://www.twitch.tv/marvelrivals]\n\n ", "imagePath": "/patchNotes/patch_20250214.jpg"}, {"id": "20250207", "title": "Marvel Rivals Version 20250207 Patch Notes", "date": "2025/02/06", "overview": "Greetings,Rivals!We're thrilled to announce that the upcoming patch drops on February 6, 2025, at 09:00:00 (UTC+0)!", "fullContent": "Greetings, Rivals!\nWe're thrilled to announce that the upcoming patch drops on February 6, 2025, at 09:00:00 (UTC+0)! This update will also be applied without server downtime—so you can dive right back into your epic battles as soon as the update is live!\n\nHere's a look at what's coming in this patch:\n\n\nALL-NEW COSTUMES\n\nLuna Snow - Mirae 2099 (Limited-time store release: 2025/02/07 02:00:00 UTC+0)\n\n[https://r.res.easebar.com/pic/20250204/b6e27bd8-b891-4826-bba7-8f336ea751b5.jpg]\n\nCaptain America - Avengers: Infinity War (Limited-time store release: 2025/02/07 02:00:00 UTC+0)\n\n[https://r.res.easebar.com/pic/20250204/d209c62d-1078-4cf1-b722-fbb060a385ed.jpg]\n\n\nBUG FIXES\n\n\nALL PLATFORMS\n\nGeneral\n1. Adjusted age rating labels.\n2. Fixed an issue with the Epic Launcher restarting after 5 minutes of inactivity, which caused random anti-cheat notifications.  \n\nMaps and Gameplay\n1. Resolved multiple instances where players could get stuck in unique terrain.\n2. Fixed an occasional synchronization issue with some doors in Hydra Charteris Base: Frozen Airfield\n\nHero Bug Fixes\n1. Venom's Wild Swing: Fixed an issue where Venom Swing could occasionally fail to end properly. Now, he'll always land with style.  \n2. Venom's Ultimate Devour: Resolved a problem where pressing Devour as soon he lands after unleashing Feast of the Abyss would sometimes deal no damage or knockback. Venom's hunger will now be fully satisfied!  \n3. Mister Fantastic's Bulletproof Rubber: Addressed a bug where his Reflexive Rubber ability could sometimes fail to end correctly. He's back to being as fantastic as ever!  \n4. Storm's Tempestuous Control: Fixed an issue where Storm's Ultimate Ability could lead to unintended positions if she unleashes it just as she passes through Doctor Strange's portal. She'll now control the storm without getting lost!  \n5. Storm's Recovery Rumble: Resolved a bug where Storm's Ultimate Ability could end abnormally if trapped by recovering destructible structures. She's ready to unleash her powers—no more interruptions in the eye of the storm!  \n6. Moon Knight's Handy Prompt: Corrected the issue where the ground visual cue for Moon Knight's Ultimate Ability would prematurely disappear—no more being caught unaware about incoming talons.  \n7. Wolverine's Fastball Bewilderment: Fixed occasional synchronization issues in the Fastball Special Team-Up Ability where on Wolverine's side, he would appear as being held by the Hulk, but others would see Wolverine still in his original place. Now, everyone's in sync to play ball.  \n8. Magneto's Ironic Iron Issue: Resolved an occasional problem where Iron Man's Ultimate Ability would still take effect even after being absorbed by Magneto's Ultimate Ability. Magneto's magnetic prowess now has it fully contained!  \n9. Jeff the Land Shark's Spitting Shenanigans: Fixed an issue where if Jeff the Land Shark spit out others just as his Ultimate Ability was about to end, it would be interrupted and automatically spit them out when the ultimate ended, causing it to look like the animation played twice. He'll now eject everyone in one smooth motion!  \n10. Banner's Revival Wardrobe: Addressed a costume issue that occasionally occurred with Banner after being revived by Rocket Raccoon's beacon. He's looking sharp and ready to hulk out!  \n11. Loki's Reload: Fixed a rare issue where Loki's Mystical Missiles would not refill after reloading during unstable network conditions. He's back to being the trickster with a full arsenal!  \n12. Loki's Transformation Trouble: Resolved a rare occurrence where Loki's Ultimate Ability transformation would end immediately after activation in unstable network conditions. His mischief will now last as intended!  \n\nStay tuned for even more thrilling content on the horizon—keep your eyes peeled for our official announcements!\n\n \n\nFor more information about us, check out and follow our other social channels.\n\nDiscord [https://discord.gg/marvelrivals]|X [https://twitter.com/MarvelRivals]|Facebook [https://www.facebook.com/marvelrivals]|Instagram [https://www.instagram.com/marvelrivals/]|TikTok [https://www.tiktok.com/@marvelrivals]|YouTube [https://www.youtube.com/@MarvelRivals]|Twitch [https://www.twitch.tv/marvelrivals]", "imagePath": "/patchNotes/patch_20250207.jpg"}, {"id": "20250122", "title": "Marvel Rivals Version 20250122 Patch Notes", "date": "2025/01/22", "overview": "We wish all players endless opportunities to forge new friendships and experience good fortune in Marvel Rivals, where fresh surprises await every day!", "fullContent": "Greetings, Rivals!\n\nWe're thrilled to announce that the upcoming patch drops on January 22, 2025, at 09:00:00 (UTC+0)! And the best part? There's no server downtime—so you can dive right back into your epic battles as soon as the update is live!\n\n\n\nHere's a look at what's coming in this patch:\n\nThe all-new Special Event \"Fortune & Colors\" gracefully lands on January 23, 2025, at 09:00:00 (UTC +0)!\n\nHere's a brief overview of the event—more details can be found in-game!\n\n[https://r.res.easebar.com/pic/20250120/c93d2e8c-e507-425f-8ca6-e55b65ada6ae.png]\n\n\nSPECIAL EVENT: FORTUNE & COLORS\n\nDive into the event to earn super rewards, including Star-Lord's \"Lion's Mane\" series costume rewards—completely FREE!\n\nEvent Duration: 2025/1/23 09:00:00 ~ 2025/02/14 08:59:59 (UTC+0)\n\n[https://r.res.easebar.com/pic/20250120/b2817bf2-1daa-4984-92c5-79bdf4374f2f.png]\n\n\nNEW MODE: CLASH OF DANCING LIONS\n\nGet ready for epic showdowns as Iron Fist, Star-Lord, and Black Widow compete in Wakanda's World Arena during the thrilling Clash of Dancing Lions.\n\n[https://r.res.easebar.com/pic/20250121/1cf711c8-43b2-429c-aca8-ec7e1f0133fc.png]\n\n\nCOMMEMORATIVE GALLERY CARD: OF FESTIVALS AND FRIENDS\n\nDuring the \"Fortune & Colors\" event, complete event missions and challenges to earn Danqing - a magical dye. Use Danqing to fill a vibrant illustration with color, and once it's beautifully framed, you'll receive an auspicious Gallery Card as a memento of this unforgettable event!\n\n\n \n\n\nNEW COSTUMES: CLASHING LIONS SERIES\n\nWe are delighted to unveil the brand new \"Clashing Lions\" costume series, bringing festive blessings to the following heroes:\n\n1. Star-Lord - Lion's Mane (Free to obtain during the Fortune & Colors event)\n\n2. Black Widow - Lion's Heartbeat (Limited-time store release: 2025/01/23~2025/02/14 UTC+0)\n\n3. Iron Fist - Lion's Gaze (Limited-time store release: 2025/01/23~2025/02/14 UTC+0)\n\nAmong these auspicious offerings, Star-Lord - Lion's Mane costume is up for grabs at NO COST during the event. The two other costumes will be available for purchase in the store and are also available in a special \"Dancing Lions\" Bundle that comes with a bonus \"Blessing Lion\" Nameplate.\n\n[https://r.res.easebar.com/pic/20250120/40ef5515-136d-49b6-b559-314a0196d0cb.png]\n\n\nSYSTEM ADJUSTMENTS\n\n\nALL PLATFORMS\n\nGeneral\n\n1. Optimized the alternate name feature in Streaming Mode, allowing players to define their own alternate names instead of relying on system-generated ones.\n\n2. Added a season dropdown menu to the Leaderboard for easy access to different season rankings.\n\n3. Enhanced the Career system by introducing a feature to view historical season rank information.\n\n \n\n\nBUG FIXES\n\n\nALL PLATFORMS\n\nGeneral\n\n1. Resolved an issue where the game would freeze after battles under certain conditions.\n\n2. Fixed an inconsistency with avatars when switching heroes while defeated in the Doom Match.\n\n3. Addressed an issue where if Winter Soldier's used his ultimate ability to defeat a shapeshifted Loki, it wouldn't count towards the ultimate ability consecutive KO achievement.\n\n4. Corrected a delay in synchronizing certain data on the Friends Leaderboard.\n\n \n\nMaps and Gameplay\n\n1. Implemented a series of fixes for various performance issues related to destructible environments.\n\n2. Resolved multiple instances where players could get stuck in unique terrain.\n\n3. Addressed several Reverse-Destruction performance issues after destruction repaired in Empire of Eternal Night maps.\n\n \n\nHero Bug Fixes\n\n1. Hawkeye's Precision: Fixed an issue where Hawkeye's passive ability Focus progress would sometimes display incorrectly. It's now as accurate as he is.\n\n2. Wolverine's Unyielding Berserk Claw Strike: Frame rate no longer affects the number of attacks in the enhanced Savage Claw after using Feral Leap.\n\n3. Invisible Woman's Psionic Stranglehold: Mobility abilities for specific heroes are now fully operational within the range of Invisible Woman's Psionic Vortex - no more containment issues!\n\n4. Mister Fantastic Double Trouble: Addressed a bug where having two Mister Fantastic (like Loki in transformation) sometimes allowed one to reuse the second part of Distended Grip.\n\n5. Namor and Invisible Woman: Fixed an issue preventing Namor and Invisible Woman from unleashing their ultimate abilities at certain door locations—now they can break through any barrier!\n\n6. Storm's Doppelganger: Resolved a problem where under low frame rate conditions, activating Storm's ultimate ability as Loki after transforming into her would be canceled.\n\n7. Wolverine's Fury Corrected: Fixed an issue where Wolverine's ultimate ability occasionally wouldn't end properly after landing after being pulled back.\n\n8. Heroic Hint Harmony: Corrected abnormal ping prompts for some heroes.\n\n9. Magik's Misstep: Addressed a bug where Magik could not use Stepping Discs after activating her ultimate ability in certain situations.\n\n10. Peni Parker's Precision: Fixed an issue where Peni's Bionic Spider-Nest would be unintentionally lifted along with the Klyntar device when raised—now, her tech remains grounded and ready for action!\n\n11. Loki's Transformation Tweaked: Resolved a problem where Loki, after using his ultimate ability to shapeshift into the Punisher, if Warrior's Gaze was triggered when the transform was about to end its effects lingered too long. The Warrior's Gaze effect will now fade as soon as the ultimate concludes—no more lingering vision trickery!\n\n12. Web-Slinging Adjustments: Fixed an issue where, in certain situations in Convoy Mode, if Peni Parker fired a Cyber-Web below the vehicle, her web would move with the vehicle. Now, her webbing sticks like it should.\n\n13. Mister Fantastic's Resilience Restored: Resolved a bug where if Mister Fantastic was knocked offline while in his inflated state and then rejoined, Mister Fantastic might be unable to use some abilities after reconnecting. He's now back in action and ready to stretch into battle!\n\n14. Webbing Dynamics Corrected: Corrected an issue where Peni Parker's web being pulled back could be blocked by enemy heroes, leading to positional anomalies. Now, her webbing will behave as intended.\n\n15. Camera Alignment Fixed: Fixed a camera misalignment issue that could occur while KO'd and revived by Adam Warlock while spectating Hela just as she rises up to launch her Ultimate Ability.\n\n \n\n\nCONSOLE\n\n1. Fixed an issue where the crosshair movement would automatically stop at extremely low pushing angles on the Xbox controller.\n\n2. Resolved a problem where the camera would automatically move for Xbox controller users after being KO'd in certain situations.\n\n \n\nClash of Dancing Lions is not to be missed! With an exciting new game mode and incredible rewards, it's time to rally your friends and join the Marvel Rivals action!\n\nWe wish all players endless opportunities to forge new friendships and experience good fortune in Marvel Rivals, where fresh surprises await every day!\n\nStay tuned for even more thrilling content on the horizon—keep your eyes peeled for our official announcements!\n\n \n\n \n\nFor more information about us, check out and follow our other social channels.\n\nDiscord [https://discord.gg/marvelrivals]|X [https://twitter.com/MarvelRivals]|Facebook [https://www.facebook.com/marvelrivals]|Instagram [https://www.instagram.com/marvelrivals/]|TikTok [https://www.tiktok.com/@marvelrivals]|YouTube [https://www.youtube.com/@MarvelRivals]|Twitch [https://www.twitch.tv/marvelrivals]", "imagePath": "/patchNotes/patch_20250122.jpg"}, {"id": "20250110", "title": "Marvel Rivals Version 20250110 Balance Post – Season 1 Begins!", "date": "2025/01/09", "overview": "Hello, Rivals! Below, we will provide a detailed introduction to the balance adjustments in the first half of Season 1!", "fullContent": "Hello, Rivals! \n\n \n\nAs Season 0 draws to a close, our analysis of battle data has revealed significant shifts in team compositions within regular matches, showcasing a vibrant diversity of lineups.\n\nHowever, as the skill level escalates, compositions centered around double shields and ranged have displayed considerable prowess. Despite this, players have continuously honed and experimented with new compositions and strategies, further enriching the battlefield. For example, a potent combination featuring Psylocke and Star-Lord has brought unparalleled map control through high mobility and formidable mid-range damage, while pairings like Namor and Winter Soldier emphasized defensive counterattacks, fortifying the rear lines and seizing opportunities for combat advantage. Whether formations revolved around Hulk's might or Adam Warlock's team-up abilities or a selection of heroes tailored for specific scenarios, it became clear that players are delving deeper into the world of Marvel Rivals. \n\nHence, in the first half of Season 1, we are set to make balance adjustments to certain heroes, enabling a broader roster to partake in more intricate gameplay, ensuring a richer, more engaging, and diverse gaming experience for all.\n\nAt the same time, regarding Season Bonuses and Team-Ups, we'd like to clarify that given the brief duration of Season 0 and everyone's recent acclimatization to Marvel Rivals, we will not make extensive changes to or adjust Team-Up abilities in Season 1. Instead, we will make minor adjustments to the existing Team-Up values. Fear not, for we are planning exciting redesigns and adjustments to Team-Up abilities in Season 2!\n\nBelow, we will provide a detailed introduction to the balance adjustments in the first half of Season 1! Suit up, rivals, and prepare to ignite the battle!\n\n \n\n\nADJUSTMENTS\n\n\nVANGUARD\n\n\nCaptain America\nSteve will receive some enhanced survivability, allowing more frequent entering and exiting of the combat.\n- Reduce the delay time for shield restoration after releasing Living Legend from 3s to 2s.\n- Reduce Liberty Rush cooldown from 12s to 10s.\n- Increase base health from 650 to 675.\n- Reduce the energy cost for releasing Freedom Charge (ultimate ability) from 3400 to 3100; Reduce the additional health provided per second to self after releasing it from 110 to 100.\n\n \n\nDoctor Strange\nWe’ll be reducing the threat range and increasing the defense window of the Sorcerer Supreme.\n- Add damage falloff to Maelstrom of Madness and Gamma Maelstrom. Starting at 5 meters and reducing to 70% at 8 meters.\n- Slightly decrease the shield value recovery rate after releasing Shield of the Seraphim from 80/s to 70/s.\n\n \n\nThor\nThe God of Thunder could use some slightly increased survivability and improved the success rate to his ultimate ability.\n- Increase base health from 500 to 525.\n- Added immunity to control effects during God of Thunder (ultimate ability).\n\n \n\nHulk\nDr. Banner has been dominant, but some decreased sustained combat capability upon entering the battlefield will bring him more in line with other Vanguards.\n- Reduce the Indestructible Guard gamma shield value for Hero Hulk from 250 to 200.\n\n \n\nVenom\nWith increased survivability and the threat of his ultimate ability, the symbiote menace will strike fear into the backlines of all enemy teams.\n- Increase the Symbiotic Resilience bonus health ratio gained per lost health point from 1 to 1.2.\n- Increase the base damage of Feast of the Abyss (ultimate ability) from 40 to 50.\n\n \n\n\nDUELIST\n\n\nBlack Panther\nWe're slightly decreasing T'Challa's combat survivability.\n- Reduce the additional health provided to self after refreshing Vibranium Marks with Spirit Rend from 40 to 30, and the upper limit of additional health provided from 120 to 75.\n\n \n\nBlack Widow\nNatasha was very much in need of optimization when evaluating the release experience of her abilities as well as a slightly increase to the threat of her ultimate ability,\n- Increase the range of the first effect of Edge Dancer from a 3-meter radius to a 5-meter radius.\n- Reduce the time required for Fleet Foot to recover from 0 stamina to full from 12s to 4s.\n- Reduce the time required for Electro-Plasma Explosion (ultimate ability) to reach maximum power from 1s to 0.6s.\n\n \n\nHawkeye\nWe'll be decreasing the medium-long range damage capability, reducing the threatening combat radius, and slightly improving the close combat resistance for the avenging archer.\n- Slightly reduce the spread angle between every two Blast Arrows.\n- Reduce the triggering distance of passive ability Archer's Focus from 60 meters to 40 meters. Reduce the maximum additional damage of the passive from 80 to 70.\n\n \n\nHela\nThe Goddess of Death has been a menace and we'll slightly decreasing her combat strength.\n- Reduce base health from 275 to 250.\n\n \n\nMagik\nThe Queen of Limbo needed an Increase to her threat after unleashing her ultimate ability.\n- Increase Umbral Incursion damage in Darkchild form from 115 to 135.\n\n \n\nMoon Knight\nThe Hand of Khonshu will receive a slight increase to the threat of his ultimate ability.\n- Increase the number of talons generated by Hand of Khonshu (ultimate ability) from 10 to 14.\n- Increase the explosion radius of each talon from 4 meters to 5 meters.\n\n \n\nNamor\nWe're optimizing the throwing feel of Namor's eggs!\n- Adjust the throwing feel of Monstro Spawn and Frozen Spawn. Now, Namor can more accurately throw them to the desired location.\n\n \n\nPsylocke\nWe'll be providing more options for other heroes to counter the demon slayer's ultimate.\n- Now Dance of the Butterfly (ultimate ability) will check for barriers (including Magneto's Metal Bulwark, Hulk's Indestructible Guard, etc.).\n\n \n\nThe Punisher\nWe're slightly increasing the damage capability of Frank's weapons.\n- Slightly reduce the spread of Deliverance and Adjudication.\n\n \n\nScarlet Witch\nWe're Increasing Wanda's combat strength when she's facing Duelists or Strategists.\n- Increase Chaos Control's fixed damage from 50/s to 60/s. \n- Reduce the percentage damage per second from 5% to 3%.\n- Increase Chthonian Burst's projectile damage from 30 to 35.\n\n \n\nStorm\nThe Weather Witch needed an overall increase to her damage capability; We're also optimizing the feel of her left-click projectile and the release experience of her ultimate ability.\n- Increase Wind Blade projectile speed from 100m/s to 150m/s and left-click damage from 50 to 55.\n- Increase Bolt Rush damage from 70 to 80.\n- After releasing Omega Hurricane (ultimate ability), the bonus health provided for herself will be increased from 350 to 450. Moreover, following its conclusion, the extra health will no longer vanish instantly but will instead diminish at a rate of 100 per second.\n\n \n\nSquirrel Girl\nWe're increasing the threat of Doreen and her furry friends in their ultimate ability.\n- Addition of a new effect to the Unbeatable Squirrel Tsunami (ultimate ability): the squirrels will rush towards the nearest enemy after bouncing instead of bouncing randomly.\n- Reduce the squirrel tsunami health from 600 to 300.\n\n \n\nWinter Soldier\nWe'll be adjusting Bucky by decreasing his long-range combat strength and increasing his survivability in medium-close range combat.\n- Increase the bonus health provided by Bionic Hook and Tainted Voltage from 30 to 40.\n- Increase Roterstern's projectile damage from 70 to 75.\n- Reduce the area damage from 70 to 65 and reduce damage decay from 65% at 40 meters to 60%.\n- Increase base health from 250 to 275.\n\n\nWolverine\nLogan will receive an increase to basic combat strength, but a slight decrease to the additional survivability after activating Undying Animal.\n- Increase base health from 300 to 350.\n- Reduce the damage reduction ratio provided by Undying Animal from 50% to 40%.\n\n \n\n\nSTRATEGIST\n\n \n\nCloak & Dagger\nTy and Tandy will receive an increase to their healing capability as well as an expansion to the coverage area of their ultimate ability.\n- Reduce Dagger Storm cooldown from 15s to 12s.\n- Increase the number of dashes in Eternal Bond (ultimate ability) from 3 to 4.\n\n \n\nJeff the Land Shark\nWe'll be adjusting the range for his ultimate ability so it now better fits the warning marker. In addition, we'll also be increasing his healing capability.\n- Adjust It's Jeff! (ultimate ability) range from a 10m sphere to a 10m radius, 5m high cylindrical spell field.\n- Increase the healing of Joyful Splash from 140/s to 150/s.\n\n \n\nLuna Snow\nWhile we've enjoyed her dropping the bass, we've made adjustments to Luna's ultimate ability to prevent players from abusing its healing capabilities.\n- Increase the interval for switching between healing and damage in Fate of Both Worlds from 0.1s to 0.5s.\n\n \n\nMantis\nWe'll be making Mantis a bit less fleet-footed, reducing her roaming support capability.\n- Reduce Nature's Favor (passive) movement boost from 2.5m/s to 1.5m/s.\n\n \n\nRocket Raccoon\nRocket could use an enhancement to his healing capability.  \n- Increase the healing of Repair Mode from 60 per/s to 70 per/s.  \n\n\n \n\n\n\nTEAM-UP ABILITIES\n\n\nHawkeye – Black Widow\nTo further tone down Hawkeye's oppression, we' ll be reducing his seasonal buff.\n- Reduce Hawkeye's season bonus from 20% to 15%.\n\n \n\nHela – Thor – Loki \nMuch like Hawkeye, Hela's overwhelming power will be receiving a slight reduction.\n- Reduce Hela's season bonus from 20% to 15%.\n\n \n\nLuna Snow- Namor\nWe'll be increasing the threat of Namor's Frozen Spawn.\n- Increase Frozen Spawn damage from 25 to 27.\n- Increase Frozen Spawn slowing effect applied to hit enemies from 25% to 30%.\n- Increase berserk state Frozen Spawn damage from 16 to 18.\n\n \n\nRocket Raccoon – The Punisher – Winter Soldier\nOne of Rocket's best tools will be available more often!\n- Reduce the cooldown of Ammo Invention from 45s to 40s.\n\n \n\nScarlet Witch - Magneto\nA bit underwhelming, the damage capability of this father-daughter Team-Up ability will be enhanced.\n- Increase Metallic Fusion projectile damage from 55 to 60.\n- Increase Metallic Fusion spell field damage from 30 to 35.\n\n \n\nThor – Storm – Captain America\nWe'll be enhancing the damage capability of Storm's side of this Team-Up ability.\n- Reduce the cooldown of Charged Gale from 20s to 15s.\n- Increase the damage of Charged Gale from 50 to 55.\n\n \n\nFor more information about us, check out and follow our other social channels.\n\nDiscord [https://discord.gg/marvelrivals]|X [https://twitter.com/MarvelRivals]|Facebook [https://www.facebook.com/marvelrivals]|Instagram [https://www.instagram.com/marvelrivals/]|TikTok [https://www.tiktok.com/@marvelrivals]|YouTube [https://www.youtube.com/@MarvelRivals]|Twitch [https://www.twitch.tv/marvelrivals]", "imagePath": "/patchNotes/patch_20250110.jpg"}, {"id": "20241219", "title": "Marvel Rivals Winter Celebration Version 20241219 Patch Notes", "date": "2024/12/19", "overview": "Get ready to embrace the chill and welcome the holiday season with the first spectacular holiday event of Marvel Rivals!", "fullContent": "Dear Rivals:\n\nGet ready to embrace the chill and welcome the holiday season with the first Special Event of Marvel Rivals!\n\nThe no downtime updates will be on December 19, 2024, 9 AM UTC (1 AM PST, 4 AM EST), players can continue playing when the patch is released. \n\n \n\nThe Winter Celebration is set to kick off on December 20, 2024, at 7AM UTC (Dec 19th, 11 PM PST, Dec 20th 2 AM EST.)  Promising a whirlwind of new gameplay, dazzling hero costumes, and bountiful rewards that you won't want to miss!\n\n[https://r.res.easebar.com/pic/20241216/838d7c54-9a01-44b0-9952-b7bda41a724a.png]\n\n\n \n\n\nSPECIAL EVENT—WINTER CELEBRATION\n\nDive into the frosty festivities and discover a treasure trove of exciting features. Join the fun and earn the Jeff the Land Shark - Cuddly Fuzzlefin series costume rewards completely for FREE!\n\nEvent Duration: 2024/12/20 07:00:00 ~ 2025/01/09 15:59:59 (UTC+0)\n\n \n\n[https://r.res.easebar.com/pic/20241216/38d3aa2c-98ed-4b88-b2f1-ba7e2d3bb934.png]\n\n\n \n\n\nNEW MODE—JEFF'S WINTER SPLASH FESTIVAL\n\nWinter? Snow? It's Jeff!\nThis lovable little rascal is ready to spread joy in his festive gear! In this delightful new mode, take control of Jeff the Land Shark and spray snowflakes to transform the garden of Yggsgard: Royal Palace into a winter wonderland.\n\n\n \n\n\nCOMMEMORATIVE GALLERY CARD—SEASON'S BEATINGS!\n\nDuring the Winter Celebration, complete missions to earn Golden and Silver Frost! Use these precious rewards to unlock and upgrade a dazzling array of greeting card decorations. Craft a personalized winter greeting card that captures your unique style and serves as a memento of this unforgettable celebration!\n\n \n\n \n\n\nNEW COSTUMES—WINTER HOLIDAY SERIES\n\nTo celebrate the season, we're unleashing an exciting Winter Holiday themed costume series for these beloved heroes:\n\n1. Jeff the Land Shark - Cuddly Fuzzlefin (Free to obtain during the 'Winter Celebration' event)\n2. Groot - Holiday Happiness (Limited-time store release: 2024/12/20 to 2025/01/10 UTC+0)\n3. Rocket Raccoon - Wild Winter (Limited-time store release: 2024/12/20 to 2025/01/10 UTC+0)\n4. Venom - Snow Symbiote (Limited-time store release: 2024/12/27 to 2025/01/17 UTC+0)\n5. Magik - Frozen Demon (Limited-time store release: 2024/12/27 to 2025/01/17 UTC+0)\n\nAmong these festive offerings, Jeff the Land Shark - Cuddly Fuzzlefin is up for grabs at no cost during the event, while the other costumes will be available for purchase in the store.\n\nAdditionally, the Captain America 'Galactic Talon' bundle and the Hawkeye 'Galactic Fangs' bundle will be removed from the store on December 27th (UTC+0).\n\n[https://r.res.easebar.com/pic/20241216/e6fc6c17-fa1d-446e-b128-fdfa3e1d50ee.png]\n\n\n \n\n\nBUG FIXES\n\n\nALL PLATFORMS\n\nGENERAL\n\n1. Double-Elimination Tournament Display: Fixed an issue where the round display was as twisted as Loki's schemes. Now, it's crystal clear!\n2. Tournament Exit Glitch: No more leaving the faction after a tournament and hitting a white screen of doom! We've fixed that pesky issue.\n3. Historical Faction Access: After a tournament ends, disbanding top factions won't let you peek into the historical faction interface from the Legends Born leaderboard anymore. Fixed it faster than Quicksilver!\n4. Faction Exit Scheduling: Exiting a faction post-tournament no longer messes with your scheduling info. All sorted!\n5. Squirrel Girl Achievement: Enemies defeated by Unbeatable Squirrel Tsunami that get KO’d two seconds after being released now count towards the achievement!\n6. Network Stability: Under poor network conditions, the map loading issue has been partially resolved! We're on the case, ensuring you don't get kicked offline due to connectivity issues. (There are many reasons that could cause this situation, and we have currently fixed part of the issues. We will continue to analyze and address other potential causes in the future.)\n\nMAPS AND GAMEPLAY\n\n1. Collision Issues: Some maps had characters stuck in edge positions like they were caught in a web. We're monitoring this and will deploy fixes faster than Spider-Man can swing through the city!\n2. Convoy Mission Performance: We've corrected an issue with abnormal vehicle performance during special convoy missions. All vehicles should now run as smoothly as a Quinjet!\n\nHERO BUG FIXES\n\n1. Doctor Strange's Portal Power: No more teammates charging Doctor Strange's ultimate ability through portals. Also, the portal terrain KOs are back in action!\n2. Winter Soldier Speed: After using his ultimate, the Winter Soldier's movement speed issues upon respawn have been fixed. He's back to full combat readiness!\n3. Rocket Raccoon's Jet Packs: Fixed the issue preventing Rocket's beacon-generated rocket jet packs from being picked up. They're now ready for action!\n4. Venom's Emote: The \"Cyan Clash\" emote's texture has been corrected. No more blue-black tentacles looking like they belong in a horror movie!\n5. Star-Lord's Low Gravity Glitch: Star-Lord's unexpected shaking when using Shift while holding Space in low gravity zones has been fixed. Now he'll rise with style!\n6. Jeff the Land Shark's Ultimate: No more premature ends to Jeff's ultimate after swallowing a target. He's now living the ultimate life longer!\n7. Terrain Deaths with Jeff: Fixed an issue where Jeff's ultimate would cause terrain KOs and occasionally lead to invisibility. He's back in a visible form!\n8. Hulk and Magik Ultimate Countdown: The countdown for Hulk and Magik's ultimate transformations is now properly managed. No transformations will go amiss!\n9. Magik's Wind-up Fix: Magik's ultimate can no longer be interrupted prematurely. She's ready to unleash her full power!\n10. Punisher's Ultimate Damage: Fixed the occasional damage issue with Punisher's ultimate caused by intense fluctuations in network conditions. His firepower will be felt!\n11. Duplicate Characters: The clone saga is over! Fixed the issue where two identical characters might appear in some special cases. \n\nCONSOLE\n\n1. Memory Mastery: We've taken our optimization powers to the next level, ensuring that console memory management is smoother than Star-Lord's dance moves. Say goodbye to crashes caused by insufficient memory and hello to uninterrupted gameplay!\n\n \n\nAs we gear up for the epic Winter Celebration, we can't wait to share the magic of the season with all our rivals. Get ready for surprises and festivities that will warm even the coldest of winter days! Thank you for your unwavering support and love—you're the true heroes of this journey. \n\nWishing each of you an unforgettable time during the Marvel Rivals Winter Celebration! \n\nStay tuned, because even more thrilling content is on the horizon! Ignite the battle!\n\n[https://r.res.easebar.com/pic/20241216/7eb28777-602b-45ea-bc67-585a160a4540.png]\n\n \n\n \n\n \n\n \n\n \n\n \n\nFor more information about us, check out and follow our other social channels.\n\nDiscord [https://discord.gg/marvelrivals]|X [https://twitter.com/MarvelRivals]|Facebook [https://www.facebook.com/marvelrivals]|Instagram [https://www.instagram.com/marvelrivals/]|TikTok [https://www.tiktok.com/@marvelrivals]|YouTube [https://www.youtube.com/@MarvelRivals]|Twitch [https://www.twitch.tv/marvelrivals]", "imagePath": "/patchNotes/patch_20241219.jpg"}, {"id": "20241210", "title": "Marvel Rivals Version 20241210 Patch Notes", "date": "2024/12/10", "overview": "Greetings, Rivals! We're here to give you the scoop on Version 20241210's updates!", "fullContent": "Greetings, Rivals! We're here to give you the scoop on Version 20241210's updates!\n\nWe noticed that some spots on the edge of the new map would cause characters to become stuck. We've had a look at the entire map and have done our best to fix this bug. However, further adjustments may still be needed to fully resolve the issue, so we ask for your understanding while we continue looking into it and working on a way to prevent this from happening again.\n\nWithout further ado, here are the details!\n\n \n\n\nALL PLATFORMS\n\n\nGENERAL\n\n· When playing highlights and recordings, crosshair deviation would be significant, and there was a possibility for lag. This issue has been resolved.\n· Changing where Highlights were saved would cause the game to crash. This issue has been resolved.\n· Players joining a Quick Match as a replacement may not be able to see heroes' equipped costumes. This issue has been resolved.\n· Mission progress on the Season Event screen would not display correctly. This issue has been resolved.\n· Fixed some textual errors. More fixes will be coming in a future update.\n· After a crash, the game had a chance to freeze for a long period of time before closing. This issue has been resolved, and now the game will close after crashing.\n· Fixed some relatively common crash issues. \n\n\nMAPS & GAME MODES\n\n· On certain maps (particularly Hydra Charteris Base: Hell's Heaven and Klyntar: Symbiotic Surface), special collisions on the edges would cause the player's character to become stuck or clip through and enter strange areas. These issues have been largely resolved, but as this affects multiple maps and areas, this bug may be present elsewhere. We will work to continue fixing such issues and develop a solution to thoroughly prevent them.\n\n· In the foggy areas of Intergalactic Empire of Wakanda: Hall of Djalia and Intergalactic Empire of Wakanda: Birnin T'Challa:\n    - Fog would disappear from Hela and Storm's perspectives when they activated their Ultimates. This issue has been resolved.\n    - After Jeff the Land Shark was revived while in the fog, his teammates and enemies would not be able to see the special effects of Joyful Splash. This issue has been resolved.\n\n· In Hydra Charteris Base: Hell's Heaven - Frozen Airfield:\n    - In Competitive, if a player was KO’d while moving near a target area, it would cause the lightings to behave abnormally. This issue has been resolved.\n    - During matches, disconnecting and reconnecting could cause desynchronization of some doors (i.e., a door looked to be closed, but the player could walk through; a door looked to be open, but the player couldn't walk through). This issue has been resolved.\n\n· Hydra Charteris Base: Hell's Heaven - Eldritch Monument:\n    - When the target area is ascending or descending, if Adam Warlock used his Ultimate, his teammates would potentially revive and be stuck beneath the terrain if they were right on the target area platform. This issue has been resolved.\n    - When the target area is ascending or descending, if Thor or Loki were revived by Hela's team-up ability, they would potentially revive and be stuck beneath the terrain if they were right on the target area platform. This issue has been resolved.\n    - When the target area is ascending or descending, if Jeff the Land Shark used his Ultimate to devour characters, they would potentially become stuck beneath the terrain if they were right on the target area platform. This issue has been resolved.\n    - When the target area is ascending or descending, if Winter Soldier hit an enemy with his Ultimate and they landed right on the target area platform, damage may be lost. This issue has been resolved.\n\n· When switching between rounds in Competitive, if the destination was not the last stage of a map, it would cause the vehicle's effective range to not display when it approached the destination, impacting determination of the effective occupation range. This issue has been resolved.\n· Upon reaching the third round in Competitive Convoy or Convergence, heroes had a chance to carry over their Ultimate energy from the second round. This issue has been resolved, and heroes will no longer inherit their Ultimate energy. \n\n\nHEROES\n\n· When Wolverine had his Deadpool & Wolverine costume equipped, no ability voice lines other than the Undying Animal ability's line would play. This issue has been resolved.\n· After Star-Lord's Guardians of the Galaxy Vol. 3's MVP animation played, sound effects would not be played in the results screen. This issue has been resolved.\n· When Iron Fist used pings, the corresponding voice lines would not be triggered. This issue has been resolved.\n· The description for ADS sensitivity in Black Widow's settings was incorrect. This issue has been resolved.\n· In certain situations, Black Widow's Ultimate would not recover energy as intended. This issue has been resolved.\n· In certain extreme situations, Captain America's Ultimate wouldn't end as intended. This issue has been resolved.\n· When Doctor Strange's portals triggered terrain KOs, they would mistakenly restore Doctor Strange's Ultimate energy. For now, we have disabled the portals' terrain KO attribution to temporarily fix this issue (i.e., terrain KOs will not count toward Doctor Strange's own KOs). Rest assured, this bug will be resolved in a future update, at which time we will restore the portals' KO attribution.\n\n \n\n\nPC\n\n· Using FSR 3 frame generation technology to modify the resolution could cause memory leaks, resulting in blurry models. This issue has been resolved.\n\n———————————————————————————————————————\n\n\nCONSOLE\n\n· After equipping the PlayStation bundle's Scarlet Spider costume, restarting the game could cause the costume to not display as correctly equipped. This issue has been resolved.\n\n\nWe'll be keeping an eye on the frequency of different bugs and fixing them as fast as we can. We also have another patch in the works—this time with new content! Be sure to follow our socials for all the latest news!\n\n \n\n \n\nFor more information about us, check out and follow our other social channels.\n\nDiscord [https://discord.gg/marvelrivals]|X [https://twitter.com/MarvelRivals]|Facebook [https://www.facebook.com/marvelrivals]|Instagram [https://www.instagram.com/marvelrivals/]|TikTok [https://www.tiktok.com/@marvelrivals]|YouTube [https://www.youtube.com/@MarvelRivals]|Twitch [https://www.twitch.tv/marvelrivals]\n\n ", "imagePath": "/patchNotes/patch_20241210.jpg"}, {"id": "20250221", "title": "Marvel Rivals Version 20250221 Patch Notes", "date": "2025/02/20", "overview": "We will continue to vigilantly monitor game bug issues and fix them as fast as we can. We also always have new content cooking! Be sure to follow our socials for all the latest news!", "fullContent": "Hey, Rivals!\n\n \n\nThe moment we've all been waiting for is finally here! The Fantastic Four are finally all uniting for the first time in Marvel Rivals, ready to take on Dracula's dark army. Here are the details of this exciting update!\n\n \n\n\n1. NEW CONTENT\n\n\n1.1 ALL PLATFORMS\n\n \n\nHeroes and Costumes\n\n- The Thing and Human Torch are ready to rock out and flame on!\n\n- New Costumes: The Thing - Trench Coat and First Family, along with Human Torch - Negative Zone Gladiator and First Family!\n\n \n\nMaps and Modes\n\n- Enter the new Convergence map - Empire of Eternal Night: Central Park.\n\n- New: An extra 0.5 seconds of grace time will be added at the end of the overtime in all modes, optimizing situations where games may end abruptly (like when players cannot be detected due to certain hero abilities or when accidentally drift slightly outside the valid range).\n\n- New: In Quick Mode, matchmaking for substitutes will no longer occur when a quick match is about to end.\n\n- Optimization: Improved loading speed at the start of matches.\n\n \n\nSeason Battle Pass and Season Story Events\n\n- The season event Midnight Features II is here!\n\n- The first round of the season 1.5 Twitch Drops event is live! Players can earn the \"Two-in-One\" spray and Hela's \"Great Galaxy\" emote. Also, stay tuned for a second round, expected to arrive mid-season 1.5, featuring a brand-new costume reward! (Keep an eye on official announcements for exact times!)\n\n- Players who purchase the Luxury Battle Pass and redeem all its rewards can now convert any leftover Chrono Tokens for Units at a specific ratio.\n\n \n\nRanked\n\n- New: Season 1 has been split into S1.0 and S1.5, with S1.0 concluding on February 21, 2025, at 8:00 AM (UTC+0). Rewards including the costume and Crest of Honors will be distributed accordingly. In S1.5, players will retain their ranks from the end of S1.0.\n\n- New: S1.5 Gold Rank costume rewards include Invisible Woman - Blood Shield and Human Torch - Blood Blaze.\n\n- New: Crest of Honor rewards for S1.5 will feature distinct designs for Grandmaster, Celestial, Eternity, and Top 500.\n\n- New: A \"Hide Own Name (Competitive)\" feature is now available for players at Diamond III and above. Once activated, your true identity will be under wraps during the loading screen, hero selection, and the start of the match. Other players won't be able to see your name right away! After a short period in the battle, your real name will pop back up.\n\n \n\nGeneral\n\n- Career System: Season statistics will now distinguish between S1.0 and S1.5, with the added ability to filter Tournament data only.\n\n- Account Deletion: A new account deletion option has been added under Settings - Other, allowing players to initiate the account deletion process.\n\n- Inactivity Detection: AFK timers will pause during the wait to respawn.\n\n- Reticle Customization: All changes will now automatically upload to server storage, preventing loss due to local issues.\n\n- Graphics and Settings: Optimized the brightness of some scene floors when \"Reflection Quality\" is set to \"Off.\"\n\n- Discord Binding Interface: Adjusted to generate an invitation code only upon clicking \"Generate.\"\n\n \n\n\n1.2 PC\n\n \n\nGraphics and Settings\n\n- NVIDIA DLSS 4 is available now, featuring DLSS Multi Frame Generation for GeForce RTX 50 Series GPU. DLSS Multi Frame Generation generates up to three additional frames per traditionally rendered frame, providing even faster performance for gamers.\n\n- AMD Radeon Anti-Lag 2 is available now, reducing the system latency (the time between user inputs and visual responses). It works best in GPU-limited scenarios. (Anti-Lag 2 Requires AMD Radeon RX 5000 Series or newer GPU)\n\n- Fixed AMD FSR3 Frame Generation frame pacing for smoother experience.\n\n \n\n1.3 Console\n\n- Adjusted the \"Model Detail\" graphics setting tier for Xbox Series S to enhance performance and stability.\n\n- Improved focus navigation in the mail system for easier content management.\n\n- Optimized aim assist range and mechanics, making crosshair deceleration more visually intuitive.\n\n \n\n\n2. FIXES AND OPTIMIZATIONS\n\n\n2.1 ALL PLATFORMS\n\n \n\nGeneral\n\n- Fixed an issue where some UI prompts in the team voice system would occasionally delay or disappear.\n\n- Resolved a rare issue where players couldn't operate after reporting a player.\n\n- Corrected a variety of language and text issues.\n\n \n\nMaps and Modes\n\n- Fixed terrain issues that could cause characters to become stuck or clip through odd locations.\n\n- Resolved various issues including floating broken objects, collision errors, etc.\n\n- Addressed several sound issues on maps.\n\n- Corrected a rare bug in Doom Match, that displayed multiple players in first place.\n\n- Rectified an issue in Conquest mode where, after reconnecting to a match, indicators, such as KO Streaks would not be displayed.\n\n \n\nHeroes\n\n- Fixed various hero SFX issues.\n\n- Resolved a series of quirky pairing performance issues between various heroes.\n\n- Spider-Man's Wall Crawl Woes: Fixed an issue where Spider-Man sometimes couldn't use his abilities while falling from the top of a wall. The web-slinger can now strike without a hitch—no more sticky situations!\n\n- Hulk's Banner Backtrack: Resolved a glitch where Hulk couldn't be detected by vehicles or mission areas during his transformation back to Bruce Banner. The big guy's identity shift is now seamless!\n\n- Doctor Strange's Portal Precision: Fixed a bug where Doctor Strange's portals could get destroyed if they intersected with broken Recursive Destruction objects during the rewind phase in Empire of Eternal Night: Midtown. The Sorcerer Supreme's portals are now as reliable as his magic!\n\n- Iron Fist's Jumping Jack: Addressed an exploit that allowed Iron Fist to perform rapid consecutive jumps under specific conditions. The martial artist's acrobatics are now finely tuned!\n\n- Loki's Revival Riddle: Fixed an issue where Loki would incorrectly indicate he was out of Adam Warlock's revival range while transforming within Adam Warlock's ultimate range.\n\n- Mister Fantastic's Elasticity Error: Fixed an unexpected interaction where Mister Fantastic's ultimate bounce range preview was affected by Cloak's Phased state. The stretchy hero's powers are now back on track!\n\n- Captain America's Unbound Shield: Corrected an issue where during Captain America's ultimate, he couldn't be stunned by Spider-Man's ultimate.\n\n- Squirrel Girl's Sonic Surprise: Resolved a sound issue where Squirrel Girl's hit sound effect was occasionally too sharp. Her acorns now land with a perfect pop!\n\n- Venom's Damage Dilemma: Fixed a problem where Venom's ultimate sometimes failed to deal damage. The symbiote's ferocity is now fully unleashed!\n\n- Mister Fantastic's Elastic Aim Adjustment: Fixed an issue where Mister Fantastic's arm orientation sometimes didn't align with the targeting reticle when using his abilities. Now, the stretchy hero can hit the mark with precision—no more twisted arms!\n\n- Magneto's Magnetic Misfire: Addressed an issue where Magneto's ultimate could pass through characters without dealing damage due to discrepancies between collision models and visual effects. The collision body is now properly optimized to better suit the visual presentation.\n\n- Portal Peril Prevention: Fixed an issue where if certain heroes were eliminated by terrain after using their abilities to pass through Doctor Strange's portals, it would sometimes not count as a KO for the Sorcerer Supreme. Now, every portal pitfall will be counted!\n\n- Doctor Strange's Visual Vanishing Act: Fixed a problem where other players sometimes couldn't see Doctor Strange's ultimate effect. The Eye of Agamotto will now dazzle everyone on the battlefield!\n\n- Doctor Strange's Control Conundrum: Resolved an issue where Doctor Strange's ultimate control effect could be overridden by Luna Snow's or Scarlet Witch's control effects, prematurely ending his control. The Sorcerer Supreme's spells now hold strong—no more magic mix-ups!\n\n- Cloak & Dagger's Ice Imprisonment: Resolved an issue where, while using their ultimate, if being frozen by Luna Snow, Cloak & Dagger would remain frozen even after taking damage. They can now break free from Luna's icy grips!\n\n- Peni Parker's Cyber Conundrum: Fixed a quirky situation where if Peni Parker was defeated while using Cyber-Bond and resurrected by Rocket Raccoon's beacon, she would be stuck in her Cyber-Bond animation. She will now be revived without any lingering effects!\n\n- Mister Fantastic's Stretch Cancel: Fixed a glitch where Mister Fantastic's Stretch Punch could be interrupted by Distended Grip during its wind-up phase, yet still erroneously deal damage. Now, the stretchy hero's attacks are consistent—no more bouncing back from unfair hits!\n\n- Loki's Ultimate Illusion Fix: Resolved an issue where, after transforming into another hero and using their ultimate, the ultimate's effects could remain in the scene if Loki was defeated during the process. We've ensured that his tricks vanish appropriately—no more ghostly ultimates haunting the battlefield!\n\n- Rocket's Revival Resurgence: Fixed an issue where heroes revived by Rocket Raccoon's B.R.B. occasionally became unable to move. Now, everyone can get back into the action without a hitch—no more stuck-in-place moments after a heroic comeback!\n\n- Moon Knight's Bounce Damage Fix: Resolved an issue where Moon Knight's bounce attack would occasionally fail to deal damage. Now, his strikes hit true.\n\n- Winter Soldier's Targeting Trouble: Addressed an issue where Winter Soldier's ultimate sometimes visually appeared to hit targets but would actually miss. The sharpshooter's aim is now spot on!\n\n \n\n \n\nWe will continue to vigilantly monitor game bug issues and fix them as fast as we can. We also always have new content cooking! Be sure to follow our socials for all the latest news!\n\n \n\nFor more information about us, check out and follow our other social channels.\n\nDiscord [https://discord.gg/marvelrivals]|X [https://twitter.com/MarvelRivals]|Facebook [https://www.facebook.com/marvelrivals]|Instagram [https://www.instagram.com/marvelrivals/]|TikTok [https://www.tiktok.com/@marvelrivals]|YouTube [https://www.youtube.com/@MarvelRivals]|Twitch [https://www.twitch.tv/marvelrivals]", "imagePath": "/patchNotes/patch_20250221.jpg"}]}